app/controllers/comments_controller.rb

  def create
    commentable = commentable_type.constantize.find(commentable_id)
    @comment = Comment.build_from(commentable, current_user.id, body)
    @comment.nickname = params[:comment][:nickname]

    respond_to do |format|
      if @comment.save
---
UPDATE "comments" SET "lft" = CASE WHEN "lft" BETWEEN 2 AND 2 THEN "lft" + 4 - 2 WHEN "lft" BETWEEN 3 AND 4 THEN "lft" + 2 - 3 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 2 AND 2 THEN "rgt" + 4 - 2 WHEN "rgt" BETWEEN 3 AND 4 THEN "rgt" + 2 - 3 ELSE "rgt" END, "parent_id" = CASE WHEN "id" = 2 THEN 1 ELSE "parent_id" END, updated_at = '2019-01-26 04:25:10.546529' WHERE "comments"."id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."commentable_id" = ? AND "comments"."commentable_type" = ? AND ("comments"."lft" BETWEEN 2 AND 4 OR "comments"."rgt" BETWEEN 2 AND 4) ORDER BY "comments"."lft" ASC)  [["commentable_id", 1], ["commentable_type", "Post"]]
INSERT INTO "comments" ("nickname", "commentable_id", "commentable_type", "body", "user_id", "lft", "rgt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
      @comment = Comment.find_by(id: params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?   [["id", 1], ["LIMIT", 1]]

  def make_child_comment
    return "" if comment_id.blank?

    parent_comment = Comment.find comment_id
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]