app/controllers/posts_controller.rb

  def show
    @post_attachments = @post.post_attachments.all

    @post = Post.find(params[:id])
---
SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."post_id" = ?  [["post_id", 9]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
        params[:post_attachments]['avatar'].each do |a|
           @post_attachment = @post.post_attachments.create!(:avatar => a)
---
INSERT INTO "posts" ("title", "description", "temperature", "time", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "post_attachments".* FROM "post_attachments" WHERE "post_attachments"."post_id" = ? AND "post_attachments"."id" IN (?, ?, ?, ?)  [["post_id", 9], ["id", 1], ["id", 2], ["id", 3], ["id", 4]]
INSERT INTO "post_attachments" ("post_id", "avatar", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 9], ["avatar", "nike_logo__1_.jpg"], ["created_at", "2019-01-25 09:32:18.101763"], ["updated_at", "2019-01-25 09:32:18.101763"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image", nil], ["updated_at", "2019-01-25 09:32:31.993396"], ["id", 9]]