app/models/user.rb

  def self.find_for_oauth(auth, signed_in_resource = nil)
    # user와 identity가 nil이 아니라면 받는다
    identity = Identity.find_for_oauth(auth)
    user = signed_in_resource ? signed_in_resource : identity.user

    # user가 nil이라면 새로 만든다.
    if user.nil?
      # 이미 있는 이메일인지 확인한다.
      email = auth.info.email
      user = User.where(:email => email).first
      unless self.where(email: auth.info.email).exists?
        # 없다면 새로운 데이터를 생성한다.
        if user.nil?
          user = User.new(
            name: auth.info.name,
            email: email ? auth.info.email : "#{auth.uid}@#{auth.provider}.com",
            password: Devise.friendly_token[0,20]
          )
          user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "unisquarebsm@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "unisquarebsm@gmail.com"], ["LIMIT", 1]]
INSERT INTO "identities" ("user_id", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["provider", "google_oauth2"], ["uid", "NYHGEQVW"], ["created_at", "2019-01-25 16:51:22.827481"], ["updated_at", "2019-01-25 16:51:22.827481"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)